Revit 2025 API
RebarContainer.Contains Method
 Checks if the RebarContainer has this item as one of its members.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public bool Contains(
	RebarContainerItem pItem
)
Public Function Contains (
	pItem As RebarContainerItem
) As Boolean
public:
bool Contains(
	RebarContainerItem^ pItem
)
member Contains :
        pItem : RebarContainerItem -> bool
Parameters
pItem RebarContainerItem
 The item to be checked if RebarContainer has it as one of its members
Return Value
Boolean
 True if RebarContainer has this item as one of its members, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace